{
  "keras_version": "2.2.4",
  "backend": "tensorflow",
  "config": {
    "layers": [
      {
        "config": {
          "batch_input_shape": [
            null,
            100
          ],
          "activity_regularizer": null,
          "name": "embedding_1",
          "embeddings_regularizer": null,
          "input_length": 100,
          "embeddings_initializer": {
            "config": {
              "seed": null,
              "maxval": 0.05,
              "minval": -0.05
            },
            "class_name": "RandomUniform"
          },
          "dtype": "float32",
          "trainable": true,
          "input_dim": 200000,
          "embeddings_constraint": null,
          "mask_zero": false,
          "output_dim": 128
        },
        "class_name": "Embedding"
      },
      {
        "config": {
          "trainable": true,
          "name": "bidirectional_1",
          "layer": {
            "config": {
              "unit_forget_bias": true,
              "go_backwards": false,
              "unroll": false,
              "trainable": true,
              "kernel_initializer": {
                "config": {
                  "seed": null,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "scale": 1
                },
                "class_name": "VarianceScaling"
              },
              "use_bias": true,
              "recurrent_activation": "hard_sigmoid",
              "return_state": false,
              "recurrent_initializer": {
                "config": {
                  "seed": null,
                  "gain": 1
                },
                "class_name": "Orthogonal"
              },
              "kernel_regularizer": null,
              "implementation": 1,
              "return_sequences": false,
              "bias_constraint": null,
              "activity_regularizer": null,
              "name": "lstm_1",
              "dropout": 0,
              "bias_initializer": {
                "config": {},
                "class_name": "Zeros"
              },
              "recurrent_regularizer": null,
              "recurrent_constraint": null,
              "activation": "tanh",
              "units": 64,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "stateful": false,
              "recurrent_dropout": 0
            },
            "class_name": "LSTM"
          },
          "merge_mode": "concat"
        },
        "class_name": "Bidirectional"
      },
      {
        "config": {
          "trainable": true,
          "seed": null,
          "name": "dropout_1",
          "rate": 0.5,
          "noise_shape": null
        },
        "class_name": "Dropout"
      },
      {
        "config": {
          "bias_constraint": null,
          "activity_regularizer": null,
          "trainable": true,
          "kernel_initializer": {
            "config": {
              "seed": null,
              "mode": "fan_avg",
              "distribution": "uniform",
              "scale": 1
            },
            "class_name": "VarianceScaling"
          },
          "use_bias": true,
          "activation": "sigmoid",
          "units": 1,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "kernel_regularizer": null,
          "name": "dense_1",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          }
        },
        "class_name": "Dense"
      }
    ],
    "name": "sequential_1"
  },
  "class_name": "Sequential"}